const state = {
  திருத்தல்நிலை: {பெயர்: 'சேருக'},
  வடிவம்: {
    ellaiyakalam: 1,
    எல்லைநிரம்: '#000000',
    எல்லைபாணி: null,
    எழுத்துருகுடும்ப: null,
    எழுத்துருசாய்வு: null,
    எழுத்துரகொட்டை: null
  },
  உருப்படிகள்: [
    { id: '3', வகை: 'துணை', பெயர்: 'எப்படி', ங: 250, ஞ: 30 },
    { id: '1', வகை: 'நிலை', பெயர்: 'ஏறி', அகலம்: 130, உயரம்: 40, ங: 500, ஞ: 30 },
    { id: '4', வகை: 'நிலை', பெயர்: 'கடல்', அகலம்: 130, உயரம்: 40, ங: 800, ஞ: 30 },
    { id: '5', வகை: 'ஓட்டம்', பெயர்: 'ஆறு', தொடக்கம்: '1', இறுதி: '4', சதம்_தொடக்கம்: 0.5, சதம்_இறுதி: 0.5, ங: 715, ஞ: 50 },
    { id: '2', வகை: 'அன்பு', தொடக்கம்: '1', இறுதி: '3', ங: 400, ஞ: 100 }
    // { id: '6', வகை: 'அன்பு', தொடக்கம்: '3', இறுதி: '5', ங: 400, ஞ: 100 }
  ]
}

const getters = {
  உருப்படி_பெற: (state) => (id) => {
    return state.உருப்படிகள்.find(உருப்படி => உருப்படி.id === id)
  },
  நிலைகள் () {
    return state.உருப்படிகள்.filter(உருப்படி => உருப்படி.வகை === 'நிலை')
  },
  ஓட்டங்கள் () {
    return state.உருப்படிகள்.filter(உருப்படி => உருப்படி.வகை === 'ஓட்டம்')
  },
  துணைகள் () {
    return state.உருப்படிகள்.filter(உருப்படி => உருப்படி.வகை === 'துணை')
  },
  அன்புகள் () {
    return state.உருப்படிகள்.filter(உருப்படி => உருப்படி.வகை === 'அன்பு')
  }
}

const mutations = {
  உருப்படி_மாற்றம் (நிலை, மாற்றம்) {
    let உருப்படி = நிலை.உருப்படிகள்.find(உருப்படி => உருப்படி.id === மாற்றம்.id)
    for (let சாபி in மாற்றம்) {
      உருப்படி[சாபி] = மாற்றம்[சாபி]
    }
  },
  செருக (நிலை, உருப்படி) {
    state.உருப்படிகள்.push(உருப்படி)
  },
  திருத்தல்நிலை_மாற்றம் (நிலை, திருத்தல்நிலை) {
    state.திருத்தல்நிலை = திருத்தல்நிலை
  }
}

const actions = {
  உருப்படி_மாற்றம் ({ commit, state }, மாற்றம்) {
    commit('உருப்படி_மாற்றம்', மாற்றம்)
  },
  செருக ({ commit, state }, உருப்படி) {
    commit('செருக', உருப்படி)
  },
  திருத்தல்நிலை_மாற்றம் ({ commit, state }, திருத்தல்நிலை) {
    commit('திருத்தல்நிலை_மாற்றம்', திருத்தல்நிலை)
  }
}

export default {
  namespaced: true,
  state,
  getters,
  mutations,
  actions
}
